src/InformationRegisters/ПаспортЛинейки/ПаспортЛинейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПаспортЛинейки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ВремяТактаМаксимальное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяТактаМинимальное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяТактаРасчётное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыпускЗаДеньРасчётный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ТехническийЛидер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Смена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/СписаниеМПЗПрочее/СписаниеМПЗПрочее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеМПЗПрочее</name>
  <basedOn>Document.ИнвентаризацияМПЗ</basedOn>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <basedOn>Document.ПоступлениеМПЗ</basedOn>
  <basedOn>Document.Перепрогон</basedOn>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ЗаявкиОтПокупателей</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПоступлениеНаЛинейку</types>
      <types>DocumentRef.Разукомплектовка</types>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.ИнвентаризацияМПЗ</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ПоступлениеМПЗПрочее</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ДвижениеМПЗ/ДвижениеМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеМПЗ</name>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ПоступлениеМПЗ</basedOn>
  <basedOn>Document.ПоступлениеМПЗПрочее</basedOn>
  <basedOn>Document.ВыпускПродукцииКанбан</basedOn>
  <basedOn>Document.МаршрутнаяКарта</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.ПоступлениеИзПереработки</basedOn>
  <basedOn>Document.Перепрогон</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.Долги</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ПоступлениеМПЗПрочее</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияВ</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСборке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/КомментарииНеисправностей/КомментарииНеисправностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КомментарииНеисправностей</name>
  <attributes>
    <name>ИспользоватьПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Линейки/Линейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Линейки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидЛинейки</name>
    <type>
      <types>EnumRef.ВидыЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Проектная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторОчереди</name>
    <type>
      <types>CatalogRef.НумераторОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСтарое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияБрака</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияГП</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияКанбанов</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторГрупповойУпаковки</name>
    <type>
      <types>CatalogRef.НумераторГрупповыхУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьБарКоды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВБракВыпуском</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаAccess</name>
    <type>
      <types>CatalogRef.ОбменДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьОдноПЗПоМТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодкаталогФотографий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаЛинеек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаКомплектации</name>
    <type>
      <types>EnumRef.ЗоныКомплектации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ШаблонДокумента</name>
      <type>
        <types>CatalogRef.ШаблоныПечатныхДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛинейкиПотребители</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыКанбанов</name>
    <attributes>
      <name>ВидКанбана</name>
      <type>
        <types>CatalogRef.ВидыКанбанов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonForms/ОформлениеБракаНовый/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ТипБрака = 1;
ПроизводственноеЗадание = Параметры.ПЗ;
РабочееМесто = Параметры.РабочееМесто;
Линейка = РабочееМесто.Линейка;
	Если Параметры.Свойство("ЭтапСпецификации") Тогда
	ЭтапСпецификации = Параметры.ЭтапСпецификации;	
	Иначе	
	ЭтапСпецификации = ПроизводственноеЗадание.Изделие;
	КонецЕсли;
МПЗ = Параметры.МПЗ;
КоличествоВПЗ = Параметры.Количество;
ЕдиницаИзмерения = МПЗ.ЕдиницаИзмерения;
	Если ТипЗнч(МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
	ТекВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
	ИначеЕсли ТипЗнч(МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда
	ТекВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КомментарииНеисправностейТабличнаяЧасть.Ссылка
		|ИЗ
		|	Справочник.КомментарииНеисправностей.ТабличнаяЧасть КАК КомментарииНеисправностейТабличнаяЧасть
		|ГДЕ
		|	КомментарииНеисправностейТабличнаяЧасть.РабочееМесто = &РабочееМесто
		|	И КомментарииНеисправностейТабличнаяЧасть.Ссылка.ИспользоватьПоУмолчанию = ИСТИНА";
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВидБрака = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;
КоличествоНаСкладе = ОбщийМодульВызовСервера.ПолучитьОстатокПоМестуХранения(Линейка.МестоХраненияКанбанов,МПЗ);                                                                                        
КонецПроцедуры

&НаСервере
Функция ОформитьСписаниеБракаНаСервере(СтатьяСписания)
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
		Если КоличествоБрака > КоличествоНаСкладе Тогда	
			Если Не ОбщийМодульВызовСервера.ОтменаЗапускаПЗ(ПроизводственноеЗадание,Ложь) Тогда
			Сообщить("Запуск производственного задания не отменён!");
			ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
			Возврат(Неопределено);			
			КонецЕсли;
		КонецЕсли; 
	Списание = Документы.СписаниеМПЗПрочее.СоздатьДокумент();
	Списание.Дата = ТекущаяДата();
	Списание.УстановитьНовыйНомер(ПрисвоитьПрефикс(ПроизводственноеЗадание.Подразделение));
	Списание.Автор = ПараметрыСеанса.Пользователь;
	Списание.ДокументОснование = ПроизводственноеЗадание;
	Списание.Подразделение = ПроизводственноеЗадание.Подразделение;
	Списание.МестоХранения = Линейка.МестоХраненияКанбанов;
	Списание.Статья = СтатьяСписания;
	Списание.Утвердил = ПроизводственноеЗадание.Подразделение.Руководитель;
	Списание.РабочееМесто = РабочееМесто;
	Списание.ВидБрака = ВидБрака;
	Списание.ЭтапЖизненногоЦикла = ЭтапЖизненногоЦикла;
	Списание.Комментарий = Комментарий;  
	ТЧ = Списание.ТабличнаяЧасть.Добавить();
	ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
	ТЧ.МПЗ = МПЗ;
	ТЧ.Количество = КоличествоБрака/МПЗ.ОсновнаяЕдиницаИзмерения.Коэффициент;
	ТЧ.ЕдиницаИзмерения = МПЗ.ОсновнаяЕдиницаИзмерения;
	Списание.Записать(РежимЗаписиДокумента.Проведение);
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Возврат(Списание.Ссылка);
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат(Неопределено);
	КонецПопытки;
КонецФункции

&НаСервере
Функция ПолучитьЛинейкуКанбана(Линейка,ВидКанбана)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛинейкиЛинейкиПотребители.Ссылка
	|ИЗ
	|	Справочник.Линейки.ЛинейкиПотребители КАК ЛинейкиЛинейкиПотребители
	|ГДЕ
	|	ЛинейкиЛинейкиПотребители.Линейка = &Линейка
	|	И ЛинейкиЛинейкиПотребители.Ссылка.ПометкаУдаления = ЛОЖЬ";
Запрос.УстановитьПараметр("Линейка", Линейка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныхЗаписей = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
		Если ВыборкаДетальныхЗаписей.Ссылка.ВидыКанбанов.Найти(ВидКанбана,"ВидКанбана") <> Неопределено Тогда
		Возврат(ВыборкаДетальныхЗаписей.Ссылка);
		КонецЕсли;
	КонецЦикла; 
Возврат(Неопределено);
КонецФункции

&НаСервере
Функция РаскрытьНаМПЗ(МТК,Спецификация,Количество,Уровень,Результат)
ВыборкаНР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н(Спецификация,ТекущаяДата());
	Пока ВыборкаНР.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаНР.Элемент.Канбан) Тогда
			Если ВыборкаНР.Элемент.Канбан.Служебный Тогда
				Если Уровень = 0 Тогда
					Если ВыборкаНР.Элемент <> МПЗ Тогда
					Продолжить;
					КонецЕсли; 
				КонецЕсли; 
			ЛинейкаКанбана = ПолучитьЛинейкуКанбана(МТК.Линейка,ВыборкаНР.Элемент.Канбан);
				Если ЛинейкаКанбана <> Неопределено Тогда
				ВыбМТК = ОбщийМодульСозданиеДокументов.СоздатьМТККанбан(ЛинейкаКанбана,МТК.Линейка.МестоХраненияКанбанов,1,ВыборкаНР.Элемент,ВыборкаНР.Норма*Количество,Ложь,МТК,"",0);
				Иначе
				Результат = Ложь;
				Сообщить(МТК.Номер+" > "+СокрЛП(ВыборкаНР.Элемент.Наименование)+" - не найдена линейка-поставщик канбана для "+МТК.Линейка);
				Возврат(Результат);
				КонецЕсли;
			Результат = РаскрытьНаМПЗ(ВыбМТК,ВыборкаНР.Элемент,ВыборкаНР.Норма*Количество,Уровень+1,Результат);
			КонецЕсли;
		Иначе
		Результат = РаскрытьНаМПЗ(МТК,ВыборкаНР.Элемент,ВыборкаНР.Норма*Количество,Уровень+1,Результат);		
		КонецЕсли; 
	КонецЦикла;
Возврат(Результат);
КонецФункции

&НаСервере
Функция СоздатьПодчиненныеМТК()
Возврат(РаскрытьНаМПЗ(ПроизводственноеЗадание.ДокументОснование,ПроизводственноеЗадание.Изделие,КоличествоБрака,0,Истина));
КонецФункции

&НаСервере
Функция ОформитьПеремещениеБракаНаСервере(СтатьяСписания)
ПаспортЛинейки = РегистрыСведений.ПаспортЛинейки.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("Линейка",Линейка));
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
		Если КоличествоБрака > КоличествоНаСкладе Тогда	
			Если Не ОбщийМодульВызовСервера.ОтменаЗапускаПЗ(ПроизводственноеЗадание,Ложь) Тогда
			Сообщить("Запуск производственного задания не отменён!");
			ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
			Возврат(Неопределено);			
			КонецЕсли;
		КонецЕсли;
	Перемещение = Документы.ДвижениеМПЗ.СоздатьДокумент();
	Перемещение.Дата = ТекущаяДата();
	Перемещение.УстановитьНовыйНомер(ПрисвоитьПрефикс(Линейка.Подразделение));
	Перемещение.Автор = ПараметрыСеанса.Пользователь;
	Перемещение.ДокументОснование = ПроизводственноеЗадание;
	Перемещение.Подразделение = Линейка.Подразделение;
	Перемещение.Сотрудник = ПаспортЛинейки.Мастер;
	Перемещение.МестоХранения = Линейка.МестоХраненияКанбанов; 
		Если ТипЗнч(МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
			Если МПЗ.Возвратный Тогда
			Перемещение.МестоХраненияВ = Справочники.МестаХранения.НайтиПоКоду("100");
			Иначе	
				Если ТипБрака = 1 Тогда
				Перемещение.МестоХраненияВ = МПЗ.Канбан.Подразделение.МестоХраненияБрака; 
				Иначе
				Перемещение.МестоХраненияВ = Линейка.Подразделение.МестоХраненияБрака;
				КонецЕсли;			
			КонецЕсли;	
		Иначе	
			Если ТипБрака = 1 Тогда
			Перемещение.МестоХраненияВ = МПЗ.Канбан.Подразделение.МестоХраненияБрака; 
			Иначе
			Перемещение.МестоХраненияВ = Линейка.Подразделение.МестоХраненияБрака;
			КонецЕсли;		
		КонецЕсли;
	Перемещение.РабочееМесто = РабочееМесто;
	Перемещение.ВидБрака = ВидБрака;
	Перемещение.ЭтапЖизненногоЦикла = ЭтапЖизненногоЦикла;
	Перемещение.Комментарий = СокрЛП(ВидБрака.Наименование)+". "+СокрЛП(СтатьяСписания.Наименование)+" ("+СокрЛП(Комментарий)+")";
	ТЧ = Перемещение.ТабличнаяЧасть.Добавить();
	ТЧ.ВидМПЗ = ?(ТипЗнч(МПЗ) = Тип("СправочникСсылка.Материалы"),Перечисления.ВидыМПЗ.Материалы,Перечисления.ВидыМПЗ.Полуфабрикаты);
	ТЧ.МПЗ = МПЗ;
	ТЧ.Количество = КоличествоБрака/МПЗ.ОсновнаяЕдиницаИзмерения.Коэффициент;
	ТЧ.ЕдиницаИзмерения =  МПЗ.ОсновнаяЕдиницаИзмерения;	
	Перемещение.Записать(РежимЗаписиДокумента.Проведение);
		Если КоличествоБрака = КоличествоНаСкладе Тогда
		ОбщийМодульВызовСервера.ОстановитьМТК(ПроизводственноеЗадание.ДокументОснование,ПараметрыСеанса.Пользователь,"Отсутствие МПЗ в связи со списанием брака",МПЗ,Неопределено,РабочееМесто);
		КонецЕсли;
			Если ТипЗнч(МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда
				Если МПЗ.Канбан.Служебный Тогда	
					Если Не СоздатьПодчиненныеМТК() Тогда
					Сообщить("Подчиненные МТК не созданы!");	
					ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
					Возврат(Неопределено);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Возврат(Перемещение.Ссылка);
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат(Неопределено);
	КонецПопытки;
КонецФункции

&НаСервере
Функция ПолучитьСтатьюСписания(Наименование)
Возврат(Справочники.СтатьиПоступленийСписанийПрочих.НайтиПоНаименованию(Наименование,Истина));
КонецФункции

&НаКлиенте
Процедура ОформитьБракПоставщика()
	Если ТипЗнч(МПЗ) = Тип("СправочникСсылка.Материалы")Тогда
	СтатьяСписания = ПолучитьСтатьюСписания("Брак материалов от поставщика");
		Если ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(МПЗ,"Возвратный") Тогда
		Результат = ОформитьПеремещениеБракаНаСервере(СтатьяСписания);
		Иначе	
		Результат = ОформитьСписаниеБракаНаСервере(СтатьяСписания);
		КонецЕсли;
	Иначе
	СтатьяСписания = ПолучитьСтатьюСписания("Внешний брак продукции участков");
	Результат = ОформитьПеремещениеБракаНаСервере(СтатьяСписания);
	КонецЕсли; 
		Если Результат <> Неопределено Тогда
		ПоказатьОповещениеПользователя("ВНИМАНИЕ!",,"Создан документ "+Результат,БиблиотекаКартинок.Пользователь);
		Этаформа.Закрыть(?(КоличествоБрака > КоличествоНаСкладе,Истина,Ложь));
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОформитьБракСобственный()
	Если ТипЗнч(МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
	СтатьяСписания = ПолучитьСтатьюСписания("Брак материалов, полученный в процессе производства");
		Если ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(МПЗ,"Возвратный") Тогда
		Результат = ОформитьПеремещениеБракаНаСервере(СтатьяСписания);
		Иначе	
		Результат = ОформитьСписаниеБракаНаСервере(СтатьяСписания);
		КонецЕсли;
	Иначе
		Если ВидБрака.Пустая() Тогда
		Сообщить("Выберите стандартный комментарий!");	
		Возврат;
		КонецЕсли; 
	СтатьяСписания = ПолучитьСтатьюСписания("Брак полуфабрикатов, полученный в процессе производства");
	Результат = ОформитьПеремещениеБракаНаСервере(СтатьяСписания);		
	КонецЕсли;	
		Если Результат <> Неопределено Тогда
		ПоказатьОповещениеПользователя("ВНИМАНИЕ!",,"Создан документ "+Результат,БиблиотекаКартинок.Пользователь);
		Этаформа.Закрыть(?(КоличествоБрака > КоличествоНаСкладе,Истина,Ложь));
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Оформить(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Если КоличествоБрака <= (КоличествоНаСкладе+КоличествоВПЗ) Тогда
			Если ТипБрака = 1 Тогда
				Если Вопрос("Вы уверены, что это брак поставщика?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				Возврат;				
				КонецЕсли;
			КонецЕсли;
				Если ТипБрака = 1 Тогда
				ОформитьБракПоставщика();
				Иначе
				ОформитьБракСобственный();
				КонецЕсли;
		Иначе
		Сообщить("Кол-во брака превышает кол-во на складе и в производственном задании "+МПЗ+"!");				
		КонецЕсли; 
	КонецЕсли;  
КонецПроцедуры

&НаСервере
Функция ПолучитьГруппуРабочихМест()
Возврат(РабочееМесто.ГруппаРабочихМест);
КонецФункции 

&НаСервере
Функция ПолучитьГруппуВидовБрака()
	Если ТипБрака = 1 Тогда
	ТекРодитель = МПЗ.Родитель;
	Иначе
	//ТекРодитель = ПроизводственноеЗадание.Изделие.Родитель;		
    ТекРодитель = ЭтапСпецификации.Родитель;
	КонецЕсли; 
		Пока Не ТекРодитель.Пустая() Цикл		
			Если Не ТекРодитель.ВидБрака.Пустая() Тогда
			Возврат(ТекРодитель.ВидБрака);
			КонецЕсли; 
		ТекРодитель = ТекРодитель.Родитель;	
		КонецЦикла; 
Возврат(Справочники.ВидыБрака.ПустаяСсылка());
КонецФункции

&НаСервере
Процедура ПолучитьЭтапЖизненногоЦикла()
	Если ВидБрака.ЭтапЖизненногоЦикла.Пустая() Тогда
		Если ТипБрака = 1 Тогда
		ЭтапЖизненногоЦикла = ОбщийМодульВызовСервера.ПолучитьЭтапЖизненногоЦикла(МПЗ);
		Иначе	
		ЭтапЖизненногоЦикла = ОбщийМодульВызовСервера.ПолучитьЭтапЖизненногоЦикла(ЭтапСпецификации);
		КонецЕсли;	
	Иначе	
	ЭтапЖизненногоЦикла = ВидБрака.ЭтапЖизненногоЦикла;
	КонецЕсли; 
КонецПроцедуры  

&НаКлиенте
Процедура ВидБракаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("Справочник.ВидыБрака.Форма.ФормаВыбораПоГруппе",Новый Структура("Родитель",ПолучитьГруппуВидовБрака()));
Результат = Ф.ОткрытьМодально(); 
	Если Результат <> Неопределено Тогда
	ВидБрака = Результат;
	ПолучитьЭтапЖизненногоЦикла();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
Этаформа.Закрыть(Ложь);
КонецПроцедуры
